---
kind: property
id: P:Autodesk.Revit.DB.ParameterMap.IsEmpty
source: html/d52f20f6-9484-879c-9ea1-0d4fcd597dd4.htm
---
# Autodesk.Revit.DB.ParameterMap.IsEmpty Property

Test to see if the map is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the map is empty then True will be returned, otherwise False.